// let i = 0

// // while (i < 10) {
// //     i = i+1
// //     console.log (i)
// // }
// do {
//     i++
//     console.log (i)
// } while (i<5)

// for (let i=1; i<=10; i = i+2) {
//     console.log ("Пройден $ {i} круг")
// }

// ===============================================================Домашка=========================================================================================================

// for (let a=2; a<=12; a=a+2) {
//     console.log (a)
// }

// for (let a=10; a>=1; a=a-1) {
//     console.log (a)
// }

// let a = 2

// while (a<=12) {
//     a=a+2
//     console.log (a)
// }

// let a = 11

// while (a>=2) {
//     a=a-1
//     console.log (a)
// }
